data/raw/gpu_load_control/llama/background_logs/llama_bgload_c64i256o256_probeconc4_main_run3_conc64.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7be2b2580fe0>, trust_remote_code=False, seed=0, num_prompts=40, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=256, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='meta-llama/Llama-3.1-8B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['role=background_load', 'label=c64i256o256_probeconc4_main_run3', 'iteration=1'], result_dir='./fixd_load_control_runs/llama/background_logs/iterations', result_filename='llama_bgload_c64i256o256_probeconc4_main_run3_conc64_iter1.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-dba9920d-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-26 12:27:03 [datasets.py:631] Sampling input_len from [255, 255] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 40/40 [00:07<00:00,  5.44it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  7.35      
Total input tokens:                      10200     
Total generated tokens:                  10240     
Request throughput (req/s):              5.44      
Output token throughput (tok/s):         1392.29   
Peak output token throughput (tok/s):    1440.00   
Peak concurrent requests:                40.00     
Total token throughput (tok/s):          2779.15   
---------------Time to First Token----------------
Mean TTFT (ms):                          131.73    
Median TTFT (ms):                        130.89    
P99 TTFT (ms):                           158.76    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          28.25     
Median TPOT (ms):                        28.25     
P99 TPOT (ms):                           28.26     
---------------Inter-token Latency----------------
Mean ITL (ms):                           28.14     
Median ITL (ms):                         28.29     
P99 ITL (ms):                            30.15     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x702996970fe0>, trust_remote_code=False, seed=0, num_prompts=40, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=256, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='meta-llama/Llama-3.1-8B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['role=background_load', 'label=c64i256o256_probeconc4_main_run3', 'iteration=2'], result_dir='./fixd_load_control_runs/llama/background_logs/iterations', result_filename='llama_bgload_c64i256o256_probeconc4_main_run3_conc64_iter2.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-f4de0011-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-26 12:27:19 [datasets.py:631] Sampling input_len from [255, 255] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 40/40 [00:07<00:00,  5.24it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  7.63      
Total input tokens:                      10200     
Total generated tokens:                  10240     
Request throughput (req/s):              5.24      
Output token throughput (tok/s):         1341.55   
Peak output token throughput (tok/s):    1400.00   
Peak concurrent requests:                40.00     
Total token throughput (tok/s):          2677.86   
---------------Time to First Token----------------
Mean TTFT (ms):                          140.85    
Median TTFT (ms):                        142.57    
P99 TTFT (ms):                           146.05    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.36     
Median TPOT (ms):                        29.36     
P99 TPOT (ms):                           29.36     
---------------Inter-token Latency----------------
Mean ITL (ms):                           29.24     
Median ITL (ms):                         29.35     
P99 ITL (ms):                            41.50     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7e2644391300>, trust_remote_code=False, seed=0, num_prompts=40, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=256, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='meta-llama/Llama-3.1-8B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['role=background_load', 'label=c64i256o256_probeconc4_main_run3', 'iteration=3'], result_dir='./fixd_load_control_runs/llama/background_logs/iterations', result_filename='llama_bgload_c64i256o256_probeconc4_main_run3_conc64_iter3.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-74e5f11b-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-26 12:27:35 [datasets.py:631] Sampling input_len from [255, 255] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 40/40 [00:07<00:00,  5.45it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  7.34      
Total input tokens:                      10200     
Total generated tokens:                  10240     
Request throughput (req/s):              5.45      
Output token throughput (tok/s):         1395.21   
Peak output token throughput (tok/s):    1440.00   
Peak concurrent requests:                40.00     
Total token throughput (tok/s):          2784.98   
---------------Time to First Token----------------
Mean TTFT (ms):                          130.64    
Median TTFT (ms):                        132.51    
P99 TTFT (ms):                           136.67    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          28.24     
Median TPOT (ms):                        28.24     
P99 TPOT (ms):                           28.24     
---------------Inter-token Latency----------------
Mean ITL (ms):                           28.13     
Median ITL (ms):                         28.29     
P99 ITL (ms):                            29.78     
==================================================